ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_rscs.c
/*******************************************************************************
* Function Name: Cy_BLE_RSCSC_ReadResponseEventHandler
****************************************************************************//**
*
*  Handles the Read Response Event for the Running Speed and Cadence Service.
*
*  \param cy_stc_ble_gattc_read_rsp_param_t *eventParam: The pointer to the data that came
*                                            with a read response for RSCS.
*
*******************************************************************************/
static void Cy_BLE_RSCSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t fFlag = 1u;
    uint32_t attrVal = 0u;
    cy_en_ble_rscs_char_index_t idx;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_RSCS_ApplCallback != NULL) &&
       (cy_ble_rscscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_RSC_FEATURE].charInfo.valueHandle ==
           cy_ble_rscscReqHandle[discIdx])
        {
            idx = CY_BLE_RSCS_RSC_FEATURE;
        }
        else if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_SENSOR_LOCATION].charInfo.valueHandle ==
                cy_ble_rscscReqHandle[discIdx])
        {
            idx = CY_BLE_RSCS_SENSOR_LOCATION;
        }
        else if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_RSC_MEASUREMENT].descriptors[CY_BLE_RSCS_CCCD] ==
                cy_ble_rscscReqHandle[discIdx])
        {
            /* Attribute is Characteristic Descriptor */
            attrVal = 1u;
            idx = CY_BLE_RSCS_RSC_MEASUREMENT;
        }
        else if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_SC_CONTROL_POINT].descriptors[CY_BLE_RSCS_CCCD] ==
                cy_ble_rscscReqHandle[discIdx])
        {
            /* Attribute is Characteristic Descriptor */
            attrVal = 1u;
            idx = CY_BLE_RSCS_SC_CONTROL_POINT;
        }
        else
        {
            /* No RSCS Characteristics were requested for read */
            fFlag = 0u;
        }

        if(fFlag != 0u)
        {
            /* Read response for characteristic */
            if(attrVal == 0u)
            {
                /* Fill Running Speed and Cadence Service read response parameter structure with
                 * Characteristic info. */
                cy_stc_ble_rscs_char_value_t rdRspParam = { .connHandle = eventParam->connHandle };

                rdRspParam.charIndex = idx;
                rdRspParam.value = &eventParam->value;

                Cy_BLE_RSCS_ApplCallback((uint32_t)CY_BLE_EVT_RSCSC_READ_CHAR_RESPONSE, (void*)&rdRspParam);
            }
            else /* Read response for characteristic descriptor */
            {
                /* Fill Running Speed and Cadence Service read response parameter structure with
                 * Characteristic Descriptor info. */
                cy_stc_ble_rscs_descr_value_t rdRspParam =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = idx,
                    .descrIndex = CY_BLE_RSCS_CCCD,
                    .value      = &eventParam->value
                };
                Cy_BLE_RSCS_ApplCallback((uint32_t)CY_BLE_EVT_RSCSC_READ_DESCR_RESPONSE, (void*)&rdRspParam);
            }

            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            cy_ble_rscscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_BLE_RSCSC_WriteResponseEventHandler
****************************************************************************//**
*
*  Handles the Write Response Event for the Running Speed and Cadence Service.
*
*  \param cy_stc_ble_conn_handle_t *eventParam: The pointer to the cy_stc_ble_conn_handle_t data
*                                   structure.
*
*******************************************************************************/
static void Cy_BLE_RSCSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t fFlag = 1u;
    uint32_t attrType = 0u;
    cy_en_ble_rscs_char_index_t idx;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_RSCS_ApplCallback != NULL) &&
       (cy_ble_rscscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_RSC_FEATURE].charInfo.valueHandle ==
           cy_ble_rscscReqHandle[discIdx])
        {
            idx = CY_BLE_RSCS_RSC_FEATURE;
        }
        else if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_SENSOR_LOCATION].charInfo.valueHandle ==
                cy_ble_rscscReqHandle[discIdx])
        {
            idx = CY_BLE_RSCS_SENSOR_LOCATION;
        }
        else if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_SC_CONTROL_POINT].charInfo.valueHandle ==
                cy_ble_rscscReqHandle[discIdx])
        {
            idx = CY_BLE_RSCS_SC_CONTROL_POINT;
        }
        else if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_RSC_MEASUREMENT].descriptors[CY_BLE_RSCS_CCCD] ==
                cy_ble_rscscReqHandle[discIdx])
        {
            /* Attribute is Characteristic Descriptor */
            attrType = 1u;
            idx = CY_BLE_RSCS_RSC_MEASUREMENT;
        }
        else if(cy_ble_rscsc[discIdx].characteristics[CY_BLE_RSCS_SC_CONTROL_POINT].descriptors[CY_BLE_RSCS_CCCD] ==
                cy_ble_rscscReqHandle[discIdx])
        {
            /* Attribute is Characteristic Descriptor */
            attrType = 1u;
            idx = CY_BLE_RSCS_SC_CONTROL_POINT;
        }
        else
        {
            /* No RSCS Characteristics were requested for write */
            fFlag = 0u;
        }

        if(fFlag != 0u)
        {
            /* This should be cleared before calling to */
            cy_ble_rscscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;

            /* Write response for characteristic */
            if(attrType == 0u)
            {
                /* Fill Running Speed and Cadence Service write response parameter structure with
                 * Characteristic info. */
                cy_stc_ble_rscs_char_value_t rdRspParam = { .connHandle = *eventParam };
                rdRspParam.charIndex = idx;
                rdRspParam.value = NULL;

                Cy_BLE_RSCS_ApplCallback((uint32_t)CY_BLE_EVT_RSCSC_WRITE_CHAR_RESPONSE, (void*)&rdRspParam);
            }
            else /* Write response for characteristic descriptor */
            {
                /* Fill Running Speed and Cadence Service write response parameter structure with
                 * Characteristic Descriptor info. */
                cy_stc_ble_rscs_descr_value_t rdRspParam = { .connHandle = *eventParam };
                rdRspParam.charIndex = idx;
                rdRspParam.descrIndex = CY_BLE_RSCS_CCCD;
                rdRspParam.value = NULL;

